## Temps passé par utilisateur sur les réseaux sociaux

In [1]:
#Importation de librairies
import pandas as pd

In [4]:
repertoire = "./Data/Reseaux/"
fichier_utilisateurs = repertoire + "utilisateurs.csv"
fichier_temps_passe = repertoire + "reseaux_sociaux.csv"

In [5]:
#1. Récupérer les données à partir des DataFrames
df_utilisateurs = pd.read_csv(fichier_utilisateurs, encoding="latin-1")

df_donnees = pd.read_csv(fichier_temps_passe, encoding="latin-1")

display(df_utilisateurs)
display(df_donnees)

         id   prénom      nom date de naissance       adresse IP
0         1     Alba    Henry        1994-08-11   115.199.131.20
1         2    Adèle   Masson        1996-10-11   169.15.124.179
2         3     Eden   Brunet        1993-07-21    236.211.89.59
3         4     Adam  Lefevre        1990-11-12     234.79.33.41
4         5    Gabin   Gerard        1993-07-25   197.121.136.20
...     ...      ...      ...               ...              ...
9995   9996  Charlie  Rolland        2001-09-21     13.32.252.95
9996   9997      Mia  Mercier        2001-07-22   155.252.161.37
9997   9998   Victor   Girard        2004-11-25    78.251.164.33
9998   9999     Jade    Roger        1991-10-22   89.247.107.245
9999  10000  Mohamed   Girard        1998-03-18  132.124.158.125

[10000 rows x 5 columns]

          id       adresse IP       site  temps passé
0          1   115.199.131.20   WhatsApp        336.9
1          2   169.15.124.179     TikTok        250.5
2          3   169.15.124.179         QQ         51.0
3          4   169.15.124.179     WeChat         82.9
4          5    236.211.89.59   WhatsApp        283.0
...      ...              ...        ...          ...
45017  45018   89.247.107.245  Pinterest         65.5
45018  45019   89.247.107.245   LinkedIn        100.6
45019  45020  132.124.158.125     WeChat        110.2
45020  45021  132.124.158.125   Facebook        210.3
45021  45022  132.124.158.125    YouTube        482.7

[45022 rows x 4 columns]

In [6]:
# 2. & 3. Renommer les colonnes
df_utilisateurs.rename(columns={'id': 'id_utilisateur'}, inplace=True)

df_donnees.rename(columns={'id': 'id_data'}, inplace=True)

display(df_utilisateurs)
display(df_donnees)

      id_utilisateur   prénom      nom date de naissance       adresse IP
0                  1     Alba    Henry        1994-08-11   115.199.131.20
1                  2    Adèle   Masson        1996-10-11   169.15.124.179
2                  3     Eden   Brunet        1993-07-21    236.211.89.59
3                  4     Adam  Lefevre        1990-11-12     234.79.33.41
4                  5    Gabin   Gerard        1993-07-25   197.121.136.20
...              ...      ...      ...               ...              ...
9995            9996  Charlie  Rolland        2001-09-21     13.32.252.95
9996            9997      Mia  Mercier        2001-07-22   155.252.161.37
9997            9998   Victor   Girard        2004-11-25    78.251.164.33
9998            9999     Jade    Roger        1991-10-22   89.247.107.245
9999           10000  Mohamed   Girard        1998-03-18  132.124.158.125

[10000 rows x 5 columns]

       id_data       adresse IP       site  temps passé
0            1   115.199.131.20   WhatsApp        336.9
1            2   169.15.124.179     TikTok        250.5
2            3   169.15.124.179         QQ         51.0
3            4   169.15.124.179     WeChat         82.9
4            5    236.211.89.59   WhatsApp        283.0
...        ...              ...        ...          ...
45017    45018   89.247.107.245  Pinterest         65.5
45018    45019   89.247.107.245   LinkedIn        100.6
45019    45020  132.124.158.125     WeChat        110.2
45020    45021  132.124.158.125   Facebook        210.3
45021    45022  132.124.158.125    YouTube        482.7

[45022 rows x 4 columns]

In [7]:
display(df_utilisateurs.head())

display(df_donnees.head())

   id_utilisateur prénom      nom date de naissance      adresse IP
0               1   Alba    Henry        1994-08-11  115.199.131.20
1               2  Adèle   Masson        1996-10-11  169.15.124.179
2               3   Eden   Brunet        1993-07-21   236.211.89.59
3               4   Adam  Lefevre        1990-11-12    234.79.33.41
4               5  Gabin   Gerard        1993-07-25  197.121.136.20

   id_data      adresse IP      site  temps passé
0        1  115.199.131.20  WhatsApp        336.9
1        2  169.15.124.179    TikTok        250.5
2        3  169.15.124.179        QQ         51.0
3        4  169.15.124.179    WeChat         82.9
4        5   236.211.89.59  WhatsApp        283.0

In [ ]:
# 4. Mergez les 2 dataframes
df_merge = df_utilisateurs.merge(df_donnees, on="adresse IP", how="left")

df_merge

In [ ]:
# 5. Calculez le nombre d'heures total passé par utilisateur
df_merge.groupby(["id_utilisateur"]).agg(temps_total=("temps passé", "sum"))

In [ ]:
# 6. Calculez le nombre d'heures total passé par utilisateur
df_tps_passe2 = df_merge.groupby(["nom", "prénom"]) \
    .agg(temps_total=("temps passé", "sum"))
df_tps_passe2

In [ ]:
# 7. Calculez le nombre d'heures total passé sur chaque réseau social
df_classement_site = df_merge.groupby(["site"]) \
    .agg(temps_total=("temps passé", "sum")) \
    .sort_values("temps_total", ascending=False)

df_classement_site

In [ ]:
df_classement_site.index.to_list()

In [ ]:
df_classement_site["temps_total"].to_list()

In [ ]:
import numpy as np
import matplotlib.pyplot as plt

x = df_classement_site.index
y = df_classement_site["temps_total"]
plt.plot(x, y, label='ma courbe')
plt.title('ma courbe')
plt.legend()
plt.show()

In [ ]:
import matplotlib.pyplot as plt

fig, ax = plt.subplots()

sites = df_classement_site.index
tps = df_classement_site["temps_total"]

ax.bar(sites, tps)

plt.show()

In [ ]:
# 8. Au dataframe obtenu précédement, ajoutez le pourcentage de temps passé pour chaque réseau social
temps_total_tous_sites = df_classement_site["temps_total"].sum()

def calculer_pourcentage_temps(temps):
    return round(temps*100 / temps_total_tous_sites, 2)


df_classement_site["pourcentage temps"] = df_classement_site["temps_total"].apply(calculer_pourcentage_temps)
#df_classement_site["pourcentage temps"] = round((df_classement_site["temps_total"] / temps_total_tous_sites) * 100, 2)

df_classement_site

In [ ]:
# 9. Au dataframe `df_merge`, ajoutez une colonne `année de naissance`

df_merge["année de naissance"] = df_merge["date de naissance"].apply(lambda date: int(date[:4]))
df_merge

#def transformer_date_naissance_annee(date_de_naissance):
#    return int(date_de_naissance[:4])

#df_merge["année de naissance"] = df_merge["date de naissance"].apply(transformer_date_naissance_annee)
#df_merge

In [ ]:
# 10. créez un tableau croisé dynamique
df_classement_site_annee_naissance = df_merge \
    .pivot_table(index=["site"], columns=["année de naissance"], values="temps passé", aggfunc="mean")
df_classement_site_annee_naissance

In [ ]:
from statistics import mean

df_classement_site_annee_naissance2 = df_merge \
    .pivot_table(index=["site"], columns=["année de naissance"], values="temps passé", aggfunc=lambda x:round(mean(x), 2))
df_classement_site_annee_naissance2

In [ ]:
df_merge \
    .pivot_table(index=["site", "année de naissance"], values="temps passé", aggfunc=lambda x:round(mean(x), 2)) \
    .reset_index()